## Rozdiel medzi .view a .copy

.copy - urobíme si __kópiu__ z dát a zmeny robíme na kópii a pôvodné dáta __zostanú nezmenené__

.view - vyberieme si určitú časť dát (focus) a tie dáta __zmeníme__

In [1]:
import pandas as pd

In [2]:
bank_users_df = pd.read_csv("bank_users.csv", usecols = ["last_name"])
bank_users_df
# vytiahne stĺpec "last_name" ako dataframe

    last_name
0       Gotts
1      Linsey
2      Gorton
3    Steanyng
4    Cockaday
..        ...
195      Oppy
196   Labbati
197   Cordery
198  Laughren
199   Peckitt

[200 rows x 1 columns]

In [3]:
bank_users_sr = bank_users_df.squeeze("columns")
bank_users_sr
# zmení dataframe s jedným stĺpcom na Series

0         Gotts
1        Linsey
2        Gorton
3      Steanyng
4      Cockaday
         ...
195        Oppy
196     Labbati
197     Cordery
198    Laughren
199     Peckitt
Name: last_name, Length: 200, dtype: object

In [4]:
bank_users_sr[0] = "Rajnáková"
bank_users_sr

0      Rajnáková
1         Linsey
2         Gorton
3       Steanyng
4       Cockaday
         ...
195         Oppy
196      Labbati
197      Cordery
198     Laughren
199      Peckitt
Name: last_name, Length: 200, dtype: object

In [5]:
bank_users_df

     last_name
0    Rajnáková
1       Linsey
2       Gorton
3     Steanyng
4     Cockaday
..         ...
195       Oppy
196    Labbati
197    Cordery
198   Laughren
199    Peckitt

[200 rows x 1 columns]

__POZOR!!!__ Toto je .view, to znamená, že ak si z dataframu urobíme Series a tam niečo zmeníme, tak sa to zmení aj v dataframe.

In [6]:
import pandas as pd

In [7]:
bank_users_dataFrame = pd.read_csv("bank_users.csv", usecols= ["last_name"])
bank_users_dataFrame

    last_name
0       Gotts
1      Linsey
2      Gorton
3    Steanyng
4    Cockaday
..        ...
195      Oppy
196   Labbati
197   Cordery
198  Laughren
199   Peckitt

[200 rows x 1 columns]

In [8]:
bank_users_series = bank_users_dataFrame.squeeze("columns").copy()
bank_users_series
# vytvorí nám kópiu stĺpca a dataframe tým nezmeníme

0         Gotts
1        Linsey
2        Gorton
3      Steanyng
4      Cockaday
         ...
195        Oppy
196     Labbati
197     Cordery
198    Laughren
199     Peckitt
Name: last_name, Length: 200, dtype: object

In [9]:
bank_users_series[0] = "Potter"
bank_users_series.head()

0      Potter
1      Linsey
2      Gorton
3    Steanyng
4    Cockaday
Name: last_name, dtype: object

In [10]:
bank_users_dataFrame.head()
# dataframe zostal nezmenený lebo sme urobili kópiu a tam sme menili dáta

  last_name
0     Gotts
1    Linsey
2    Gorton
3  Steanyng
4  Cockaday